tbobd/certification/test7/HotelRoomAvailabilityRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:hot="http://TekTravel/HotelBookingApi">
<soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <hot:Credentials UserName="clubonehotelsTest" Password="Clu@28527768">
    </hot:Credentials>
    <wsa:Action>http://TekTravel/HotelBookingApi/AvailableHotelRooms</wsa:Action>
    <wsa:To>https://api.tbotechnology.in/hotelapi_v7/hotelservice.svc</wsa:To>
</soap:Header>
<soap:Body>
    <hot:HotelRoomAvailabilityRequest>
        <hot:SessionId>8fef13c4-ea3e-4279-a985-0cff0917c718</hot:SessionId>
        <hot:ResultIndex>7</hot:ResultIndex>
        <hot:HotelCode>1180679</hot:HotelCode>
        <hot:ResponseTime>23</hot:ResponseTime>
        <hot:IsCancellationPolicyRequired>true</hot:IsCancellationPolicyRequired>
    </hot:HotelRoomAvailabilityRequest>
</soap:Body>
</soap:Envelope>